; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	thermograph8 - mode
	infrared3 - mode
	image2 - mode
	infrared6 - mode
	thermograph9 - mode
	thermograph5 - mode
	image7 - mode
	spectrograph0 - mode
	image1 - mode
	spectrograph4 - mode
	GroundStation2 - direction
	Star0 - direction
	GroundStation5 - direction
	Star3 - direction
	Star4 - direction
	Star1 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Planet10 - direction
)
(:init
	(supports instrument0 spectrograph4)
	(supports instrument0 infrared6)
	(supports instrument0 thermograph5)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation5)
	(supports instrument1 thermograph9)
	(supports instrument1 thermograph8)
	(calibration_target instrument1 Star4)
	(supports instrument2 image2)
	(calibration_target instrument2 Star0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star9)
	(supports instrument3 image2)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 GroundStation5)
	(calibration_target instrument3 Star1)
	(supports instrument4 spectrograph4)
	(supports instrument4 thermograph5)
	(supports instrument4 image7)
	(supports instrument4 infrared3)
	(calibration_target instrument4 Star3)
	(supports instrument5 spectrograph0)
	(supports instrument5 thermograph5)
	(calibration_target instrument5 Star1)
	(calibration_target instrument5 Star4)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet7)
)
(:goal (and
	(pointing satellite1 Star3)
	(have_image Phenomenon6 infrared6)
	(have_image Phenomenon6 image7)
	(have_image Planet7 spectrograph0)
	(have_image Planet7 image2)
	(have_image Planet7 spectrograph4)
	(have_image Phenomenon8 infrared6)
	(have_image Phenomenon8 spectrograph4)
	(have_image Phenomenon8 image1)
	(have_image Star9 image2)
	(have_image Star9 thermograph9)
	(have_image Star9 spectrograph0)
	(have_image Planet10 spectrograph4)
	(have_image Planet10 thermograph8)
	(have_image Planet10 infrared6)
))

)

; plan
1. (turn_to satellite2 star3 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 star3)
   goals met: 0 of 15
2. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 15
3. (calibrate satellite2 instrument4 star3)
   added: (calibrated instrument4)
   goals met: 0 of 15
4. (turn_to satellite2 planet7 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 planet7)
   goals met: 0 of 15
5. (take_image satellite2 planet7 instrument4 spectrograph4)
   added: (have_image planet7 spectrograph4)
   goals met: 1 of 15
6. (turn_to satellite2 phenomenon6 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 phenomenon6)
   goals met: 1 of 15
7. (turn_to satellite1 star4 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star4)
   goals met: 1 of 15
8. (turn_to satellite0 groundstation2 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 groundstation2)
   goals met: 1 of 15
9. (take_image satellite2 phenomenon6 instrument4 image7)
   added: (have_image phenomenon6 image7)
   goals met: 2 of 15
10. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 2 of 15
11. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 15
12. (switch_off instrument4 satellite2)
   deleted: (power_on instrument4)
   added: (power_avail satellite2)
   goals met: 2 of 15
13. (calibrate satellite1 instrument1 star4)
   added: (calibrated instrument1)
   goals met: 2 of 15
14. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 2 of 15
15. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 2 of 15
16. (turn_to satellite0 phenomenon6 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon6)
   goals met: 2 of 15
17. (take_image satellite0 phenomenon6 instrument0 infrared6)
   added: (have_image phenomenon6 infrared6)
   goals met: 3 of 15
18. (turn_to satellite0 phenomenon8 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon8)
   goals met: 3 of 15
19. (take_image satellite0 phenomenon8 instrument0 image1)
   added: (have_image phenomenon8 image1)
   goals met: 4 of 15
20. (take_image satellite0 phenomenon8 instrument0 infrared6)
   added: (have_image phenomenon8 infrared6)
   goals met: 5 of 15
21. (take_image satellite0 phenomenon8 instrument0 spectrograph4)
   added: (have_image phenomenon8 spectrograph4)
   goals met: 6 of 15
22. (turn_to satellite0 planet10 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet10)
   goals met: 6 of 15
23. (take_image satellite0 planet10 instrument0 infrared6)
   added: (have_image planet10 infrared6)
   goals met: 7 of 15
24. (take_image satellite0 planet10 instrument0 spectrograph4)
   added: (have_image planet10 spectrograph4)
   goals met: 8 of 15
25. (turn_to satellite1 planet10 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 planet10)
   goals met: 8 of 15
26. (take_image satellite1 planet10 instrument1 thermograph8)
   added: (have_image planet10 thermograph8)
   goals met: 9 of 15
27. (turn_to satellite1 star9 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 star9)
   goals met: 9 of 15
28. (take_image satellite1 star9 instrument1 thermograph9)
   added: (have_image star9 thermograph9)
   goals met: 10 of 15
29. (turn_to satellite1 star3 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star3)
   goals met: 11 of 15
30. (turn_to satellite2 groundstation5 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 groundstation5)
   goals met: 11 of 15
31. (calibrate satellite2 instrument3 groundstation5)
   added: (calibrated instrument3)
   goals met: 11 of 15
32. (turn_to satellite2 planet7 groundstation5)
   deleted: (pointing satellite2 groundstation5)
   added: (pointing satellite2 planet7)
   goals met: 11 of 15
33. (take_image satellite2 planet7 instrument3 image2)
   added: (have_image planet7 image2)
   goals met: 12 of 15
34. (take_image satellite2 planet7 instrument3 spectrograph0)
   added: (have_image planet7 spectrograph0)
   goals met: 13 of 15
35. (turn_to satellite2 star9 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 star9)
   goals met: 13 of 15
36. (take_image satellite2 star9 instrument3 image2)
   added: (have_image star9 image2)
   goals met: 14 of 15
37. (take_image satellite2 star9 instrument3 spectrograph0)
   added: (have_image star9 spectrograph0)
   goals met: 15 of 15
